[
	{
		"body": "<p>I thrive on new challenges and I am highly motivated to achieve the very best in all that I do. I enjoy working with a wide range of technologies and pushing myself to maximise my potential. I have worked in both the public and private sectors for several years.</p><p>I have strong concreate knowledge of several languages such as Javascript, Typescripts, C# .NET, Python, PHP, Ruby and VB .NET and I am high proficient in frameworks such as React, AngularJS, MVC architecture, RESTful API, GraphQL, Ruby on Rails and Laravel.</p><p>My code adheres to all SOLID principles and is well maintainable DRY code using the XP values. My GitHub account has multiple working examples of Ruby, C#, Python, PHP, TypeScript, JavaScript and VB Script projects that are all open source. Examples of my projects include Frogger, Tetris, Racer, Space Invaders, Mine Sweep, Connect 4, Pacman and Battleships to name just a few.</p><p>I am competent in using Test Driven Design frameworks such as Jest, Cypress, Mocha, Capybara, Jasmine, Rspec, NUnit, XUnit and have even written my own test framework using JavaScript. I work in an agile environment and have been a Scrum Master for several years, taking a major part in daily stand ups, weekly retrospectives and regular code reviews in order to help others and to better myself.</p><p>I have over 13 years commercial experience of System Administration using technologies such as Azure DevOps, AWS DevOps, MS SQL Server, Oracle databases using CRUD commands, MS Server (all versions), MS Exchange, MS MDT, Windows support and I am an Oracle Certified Associate.</p><p>I have worked effectively as part of a team, paired programming or individually using version control through GitHub, Azure DevOps and TeamCity. I believe I am a well-rounded team member that will fit into any organisation with minimal disruption. I have commercial experience in the whole software development life cycle producing software from creation to completion.</p>"
	}
]